In [1]:
#Contents
#Data Consistency Checks - Mixed-Type Data - Missing Values - Duplicates - Tidying Up and Exporting Changes

In [2]:
#Import Libraries

In [3]:
import pandas as pd
import numpy as np
import os

In [4]:
#import products.csv data

In [5]:
path = r'/Users/malikpressley/Desktop/Achievement 4/Instacart Basket Analysis'

In [6]:
# using path variable to import “products.csv” with the os library.

In [7]:
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'),      

index_col = False)

In [8]:
#import orders data

In [9]:
df_ords = pd.read_csv(r'/Users/malikpressley/Desktop/Achievement 4/Instacart Basket Analysis/02 Data/Original Data/orders.csv', index_col = False)

In [10]:
df_prods

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3
...,...,...,...,...,...
49688,49684,"Vodka, Triple Distilled, Twist of Vanilla",124,5,5.3
49689,49685,En Croute Roast Hazelnut Cranberry,42,1,3.1
49690,49686,Artisan Baguette,112,3,7.8
49691,49687,Smartblend Healthy Metabolism Dry Cat Food,41,8,4.7
49692,49688,Fresh Foaming Cleanser,73,11,13.5

In [11]:
df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      9.994136
std    14343.717401     38.316774       5.850282    453.519686
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

In [12]:
# the aisle_id and max prices seems to be very high

In [13]:
df_ords

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0
...,...,...,...,...,...,...,...
3421078,2266710,206209,prior,10,5,18,29.0
3421079,1854736,206209,prior,11,4,10,30.0
3421080,626363,206209,prior,12,1,12,18.0
3421081,2977660,206209,prior,13,1,12,7.0
3421082,272231,206209,train,14,6,14,30.0

In [83]:
df_ords.describe()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

## Mixed-Type Example

In [84]:
# Create a data frame

In [85]:
df_test = pd.DataFrame()

In [86]:
#Create a mixed type column

In [87]:
df_test['mix'] = ['a', 'b', 1, True]

In [88]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [89]:
#check for mixed-type column

In [90]:
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [91]:
#changing data type from numeric to string

In [92]:
df_test['mix'] = df_test['mix'].astype('str')

## Missing Values

In [93]:
#checking for missing values using the isnull() function

In [94]:
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [95]:
#creating subset of only null values
#call subset df_nan

In [96]:
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [97]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

## Linear Interpolation

In [98]:
#comparing number of rows in dataframes with .shape function

In [99]:
df_prods.shape

(49693, 5)

In [100]:
#create new data frame with non-missing values

In [101]:
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [102]:
df_prods_clean.shape

(49677, 5)

In [103]:
#new dataframe has exactly 16 less rows

## Duplicate Values

In [104]:
# Looking for full duplicates within df_prods_clean data

In [105]:
#full duplcates are multiple rows with the exact same values

In [106]:
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [107]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [108]:
#check number of rows to compare after deleting duplicate values

In [109]:
df_prods_clean.shape

(49677, 5)

In [110]:
#create new dataframe that does not include duplicates

In [111]:
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [112]:
df_prods_clean_no_dups.shape

(49672, 5)

In [113]:
#using df.describe on clean products data

In [114]:
df_prods_clean.describe()

         product_id      aisle_id  department_id        prices
count  49677.000000  49677.000000   49677.000000  49677.000000
mean   24850.194235     67.763110      11.728687      9.993164
std    14340.588602     38.316396       5.850651    453.592708
min        1.000000      1.000000       1.000000      1.000000
25%    12433.000000     35.000000       7.000000      4.100000
50%    24851.000000     69.000000      13.000000      7.100000
75%    37267.000000    100.000000      17.000000     11.100000
max    49688.000000    134.000000      21.000000  99999.000000

In [115]:
#the max prices and max aisle_id seem to be very high

In [116]:
#export data

In [117]:
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data','Prepared Data', 'products_checked.csv'))

# Task 4.5

## Question 2

In [118]:
# Run the df.describe() function on your df_ords dataframe.

In [119]:
df_ords.describe()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [120]:
# share in a markdown cell whether anything about the data looks off or should be investigated further.

the order_dow has a minimum of 0. There cannot be a 0 day. The same for order_hour_of_day

## Question 3

In [121]:
## Check for mixed-data type in your df_ords dataframe

In [122]:
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis=1)
  if len(df_ords[weird]) > 0:
    print(col)

In [123]:
#the code did not execute showing mixed therefore there are no mixed-data types in my df_ords data frame

## Question 5

In [124]:
#Run a check for missing values in your df_ords dataframe.

In [125]:
df_ords.isnull().sum()

order_id                       0
user_id                        0
eval_set                       0
order_number                   0
order_dow                      0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [126]:
# In a markdown cell, report your findings and propose an explanation for any missing values you find.

The days_since_prior_order has a lot of missing values. However, this just means some customers had many days that they did not place any orders. I will filter out the data

In [127]:
#create new subset of only null values
#call subset df_ords_nan

In [128]:
df_ords_nan = df_ords[df_ords['days_since_prior_order'].isnull() == True]

In [129]:
df_ords_nan

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
11,2168274,2,prior,1,2,11,NaN
26,1374495,3,prior,1,1,14,NaN
39,3343014,4,prior,1,6,11,NaN
45,2717275,5,prior,1,3,12,NaN
...,...,...,...,...,...,...,...
3420930,969311,206205,prior,1,4,12,NaN
3420934,3189322,206206,prior,1,3,18,NaN
3421002,2166133,206207,prior,1,6,19,NaN
3421019,2227043,206208,prior,1,1,15,NaN
3421069,3154581,206209,prior,1,3,11,NaN

In [130]:
#comparing number of rows in dataframes with.shape function

In [131]:
df_ords.shape

(3421083, 7)

In [132]:
#create new data frame with non-missing values

In [133]:
df_ords_clean = df_ords[df_ords['days_since_prior_order'].isnull() == False]

In [134]:
df_ords_clean.shape

(3214874, 7)

In [135]:
#new data frame has exactly 206209 less rows

## Question 7

In [136]:
# run a check for duplicate values in df_ords data

In [137]:
df_dups_2 = df_ords_clean[df_ords_clean.duplicated()]

In [138]:
df_dups_2

Empty DataFrame
Columns: [order_id, user_id, eval_set, order_number, order_dow, order_hour_of_day, days_since_prior_order]
Index: []

In [139]:
df_ords_clean_no_dups = df_ords_clean.drop_duplicates()

In [140]:
df_ords_clean_no_dups.shape

(3214874, 7)

In [141]:
#In a markdown cell, report your findings and propose an explanation for any duplicate values you find.

No duplicates were found

## Question 8

In [142]:
# Address the duplicates using an appropriate method.
# In a markdown cell, explain why you used your method of choice.

I did not find any duplicates but, I still went ahead and made a new data set to drop any duplictes just in case. I chose the new data frame because I want to have cleaner data. But the number of rows remained the same

In [143]:
#Export your final, cleaned df_prods and df_ords data as “.csv” files in your “Prepared Data” folder and give them appropriate, succinct names.

In [144]:
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data','Prepared Data', 'products_checked.csv'))

In [145]:
df_ords_clean_no_dups.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_checked.csv'))

In [14]:
df_ords_clean_no_dups

NameError: name 'df_ords_clean_no_dups' is not defined